{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-06-16T20:37:49.0094794Z","creationSource":null,"description":"Remove specific users from the local Administrator group","lastModifiedDateTime":"2025-06-16T20:37:49.0094794Z","name":"VWC BL - Windows - Restrict local administrator","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"dbb0aa66-f614-4b67-a509-32d0a417e1b6","templateReference":{"templateId":"22968f54-45fa-486c-848e-f8224aa69772_1","templateFamily":"endpointSecurityAccountProtection","templateDisplayName":"Local user group membership","templateDisplayVersion":"Version 1"},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_config_localusersandgroups_configure","settingInstanceTemplateReference":{"settingInstanceTemplateId":"de06bec1-4852-48a0-9799-cf7b85992d45"},"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup","settingInstanceTemplateReference":null,"groupSettingCollectionValue":[{"settingValueTemplateReference":null,"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_desc","settingInstanceTemplateReference":null,"choiceSettingCollectionValue":[{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_desc_administrators","children":[]}]},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_action","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_action_remove_update","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_userselectiontype","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_userselectiontype_users","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance","settingDefinitionId":"device_vendor_msft_policy_config_localusersandgroups_configure_groupconfiguration_accessgroup_users","settingInstanceTemplateReference":null,"simpleSettingCollectionValue":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":"S-1-12-1-220526269-1334646135-2136977847-4061271263"}]}]}}]}]}]}]}}]}